code-review/NRB_3471_3546/База_Было/Enums/МестаОбращаемостиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МестаОбращаемостиЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбращаетсяНаМосковскойБирже</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбращаетсяНаИностранныхБиржах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбращаетсяНаБирже</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПоТоргамОтсутствуетИлиЦБПогашена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/МестаОбращаемостиЦБ/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает ссылку на значение перечисления МестаОбращаемостиЦБ по признаку обращаемости ЦБ из RuData
//
// Параметры:
//  ПризнакОбращаемостиЦБ - Строка - Признак обращаемости ЦБ из RuData
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.МестаОбращаемостиЦБ - ссылка на значение перечисления
//
Функция МестоОбращаемостиЦБ(ПризнакОбращаемостиЦБ) Экспорт
	
	МестаОбращаемостиЦБ = Перечисления.МестаОбращаемостиЦБ;
	Если ПризнакОбращаемостиЦБ = "0" Тогда
		Возврат МестаОбращаемостиЦБ.НеОбращаетсяНаБирже;
	ИначеЕсли ПризнакОбращаемостиЦБ = "1" Тогда
		Возврат МестаОбращаемостиЦБ.ОбращаетсяНаМосковскойБирже;
	ИначеЕсли ПризнакОбращаемостиЦБ = "2" Или ПризнакОбращаемостиЦБ = "3" Тогда
		Возврат МестаОбращаемостиЦБ.ОбращаетсяНаИностранныхБиржах;
	ИначеЕсли ПризнакОбращаемостиЦБ = Неопределено Или НРег(ПризнакОбращаемостиЦБ) = НРег("null") Тогда
		Возврат МестаОбращаемостиЦБ.ИнформацияПоТоргамОтсутствуетИлиЦБПогашена;
	Иначе
		Возврат МестаОбращаемостиЦБ.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти
